# 목록확인
# dir
# ls
# 디렉토리 이동
# cd basic
# 파이썬 버전 확인 및 path 확인
# python -v 
#  --> Python 3.7.4

# 파이썬 구동명령
# 1. python p1.py
# 2. 우클릭 > run python file in terminal (명령어 생략 가능)
# 3. F5 > python 선택(디버깅 모드)
# 4. 쥬피터 노트북 사용
# 4.1 shift + enter 바로 구동

# 디버깅
# 좌측 점 만들고 f5누른 후 python(해당 언어) 누르면 거기서 스탑

# ctrl + p 하면 서치하거나 특정 액션 가능

print('hello python')

# 여러줄 주석, 어떤 변수도 받지 않으므로
# 그냥 정의되고 끝, 프로그램에 영향 X -> 주석으로 간주
"""
 3개짜리 표현은 여러줄 문자열 표현, 문자열의 구조를 유지할 때 사용 -> sql 등에 사용
 파이썬의 주석은 한 줄 주석만 존재, #
 여러줄 주석은 표현이 따로 없어 여러줄 표현하는 문자열 구조를 차용
"""
